#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.private_key: Refreshing state... [id=6bab6f5b97b1cacb859a16f20c3d554c5f2df3b8]
linode_nodebalancer.app_nb: Refreshing state... [id=187417]
acme_registration.reg: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/acct/343768060]
linode_domain.domain: Refreshing state... [id=1770664]
linode_instance.app[0]: Refreshing state... [id=33345123]
linode_instance.db: Refreshing state... [id=33345124]
linode_domain_record.rewards: Refreshing state... [id=19849317]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # acme_registration.reg has been deleted
  - resource "acme_registration" "reg" {
      - account_key_pem  = (sensitive value)
      - email_address    = "linode@dangerous.tech" -> null
      - id               = "https://acme-v02.api.letsencrypt.org/acme/acct/343768060" -> null
      - registration_url = "https://acme-v02.api.letsencrypt.org/acme/acct/343768060" -> null
    }

  # linode_domain.domain has been deleted
  - resource "linode_domain" "domain" {
      - domain      = "josh.services" -> null
      - expire_sec  = 0 -> null
      - id          = "1770664" -> null
      - refresh_sec = 0 -> null
      - retry_sec   = 0 -> null
      - soa_email   = "linode@dangerous.tech" -> null
      - status      = "active" -> null
      - tags        = [
          - "fealty",
        ] -> null
      - ttl_sec     = 30 -> null
      - type        = "master" -> null
    }

  # linode_domain_record.rewards has been deleted
  - resource "linode_domain_record" "rewards" {
      - domain_id   = 1770664 -> null
      - id          = "19849317" -> null
      - name        = "rewards" -> null
      - port        = 0 -> null
      - priority    = 0 -> null
      - record_type = "A" -> null
      - target      = "45.79.244.88" -> null
      - ttl_sec     = 30 -> null
      - weight      = 0 -> null
    }

  # linode_instance.app[0] has been deleted
  - resource "linode_instance" "app" {
      - authorized_users   = [
          - "linodeDT",
        ] -> null
      - backups            = [
          - {
              - enabled  = true
              - schedule = [
                  - {
                      - day    = "Scheduling"
                      - window = "Scheduling"
                    },
                ]
            },
        ] -> null
      - backups_enabled    = true -> null
      - boot_config_label  = "My fealty-app Profile" -> null
      - id                 = "33345123" -> null
      - image              = "private/15093536" -> null
      - ip_address         = "170.187.148.179" -> null
      - ipv4               = [
          - "170.187.148.179",
          - "192.168.136.19",
        ] -> null
      - ipv6               = "2600:3c02::f03c:92ff:fea4:6af5/128" -> null
      - label              = "fealty_app_1" -> null
      - private_ip         = true -> null
      - private_ip_address = "192.168.136.19" -> null
      - region             = "us-southeast" -> null
      - root_pass          = (sensitive value)
      - specs              = [
          - {
              - disk     = 25600
              - memory   = 1024
              - transfer = 1000
              - vcpus    = 1
            },
        ] -> null
      - status             = "running" -> null
      - swap_size          = 512 -> null
      - tags               = [
          - "fealty",
        ] -> null
      - type               = "g6-nanode-1" -> null
      - watchdog_enabled   = true -> null

      - alerts {
          - cpu            = 90 -> null
          - io             = 10000 -> null
          - network_in     = 10 -> null
          - network_out    = 10 -> null
          - transfer_quota = 80 -> null
        }

      - config {
          - kernel       = "linode/latest-64bit" -> null
          - label        = "My fealty-app Profile" -> null
          - memory_limit = 0 -> null
          - root_device  = "/dev/sda" -> null
          - run_level    = "default" -> null
          - virt_mode    = "paravirt" -> null

          - devices {
              - sda {
                  - disk_id    = 67157759 -> null
                  - disk_label = "fealty-app" -> null
                  - volume_id  = 0 -> null
                }

              - sdb {
                  - disk_id    = 67157760 -> null
                  - disk_label = "512 MB Swap Image" -> null
                  - volume_id  = 0 -> null
                }
            }

          - helpers {
              - devtmpfs_automount = true -> null
              - distro             = true -> null
              - modules_dep        = true -> null
              - network            = true -> null
              - updatedb_disabled  = true -> null
            }

          - interface {
              - ipam_address = "10.10.10.2/24" -> null
              - label        = "fealty-vlan" -> null
              - purpose      = "vlan" -> null
            }
        }

      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "ext4" -> null
          - id               = 67157759 -> null
          - label            = "fealty-app" -> null
          - read_only        = false -> null
          - size             = 25088 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }
      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "swap" -> null
          - id               = 67157760 -> null
          - label            = "512 MB Swap Image" -> null
          - read_only        = false -> null
          - size             = 512 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }

      - interface {
          - ipam_address = "10.10.10.2/24" -> null
          - label        = "fealty-vlan" -> null
          - purpose      = "vlan" -> null
        }
    }

  # linode_instance.db has been deleted
  - resource "linode_instance" "db" {
      - authorized_users  = [
          - "linodeDT",
        ] -> null
      - backups           = [
          - {
              - enabled  = true
              - schedule = [
                  - {
                      - day    = "Scheduling"
                      - window = "Scheduling"
                    },
                ]
            },
        ] -> null
      - backups_enabled   = true -> null
      - boot_config_label = "My fealty-db Profile" -> null
      - id                = "33345124" -> null
      - image             = "private/15093538" -> null
      - ip_address        = "170.187.148.194" -> null
      - ipv4              = [
          - "170.187.148.194",
        ] -> null
      - ipv6              = "2600:3c02::f03c:92ff:fea4:6a7e/128" -> null
      - label             = "fealty_db" -> null
      - private_ip        = false -> null
      - region            = "us-southeast" -> null
      - specs             = [
          - {
              - disk     = 25600
              - memory   = 1024
              - transfer = 1000
              - vcpus    = 1
            },
        ] -> null
      - status            = "running" -> null
      - swap_size         = 512 -> null
      - tags              = [
          - "fealty",
        ] -> null
      - type              = "g6-nanode-1" -> null
      - watchdog_enabled  = true -> null

      - alerts {
          - cpu            = 90 -> null
          - io             = 10000 -> null
          - network_in     = 10 -> null
          - network_out    = 10 -> null
          - transfer_quota = 80 -> null
        }

      - config {
          - kernel       = "linode/latest-64bit" -> null
          - label        = "My fealty-db Profile" -> null
          - memory_limit = 0 -> null
          - root_device  = "/dev/sda" -> null
          - run_level    = "default" -> null
          - virt_mode    = "paravirt" -> null

          - devices {
              - sda {
                  - disk_id    = 67157761 -> null
                  - disk_label = "fealty-db" -> null
                  - volume_id  = 0 -> null
                }

              - sdb {
                  - disk_id    = 67157762 -> null
                  - disk_label = "512 MB Swap Image" -> null
                  - volume_id  = 0 -> null
                }
            }

          - helpers {
              - devtmpfs_automount = true -> null
              - distro             = true -> null
              - modules_dep        = true -> null
              - network            = true -> null
              - updatedb_disabled  = true -> null
            }

          - interface {
              - ipam_address = "10.10.10.3/24" -> null
              - label        = "fealty-vlan" -> null
              - purpose      = "vlan" -> null
            }
        }

      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "ext4" -> null
          - id               = 67157761 -> null
          - label            = "fealty-db" -> null
          - read_only        = false -> null
          - size             = 25088 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }
      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "swap" -> null
          - id               = 67157762 -> null
          - label            = "512 MB Swap Image" -> null
          - read_only        = false -> null
          - size             = 512 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }

      - interface {
          - ipam_address = "10.10.10.3/24" -> null
          - label        = "fealty-vlan" -> null
          - purpose      = "vlan" -> null
        }
    }

  # linode_nodebalancer.app_nb has been deleted
  - resource "linode_nodebalancer" "app_nb" {
      - client_conn_throttle = 20 -> null
      - created              = "2021-12-31T13:28:07Z" -> null
      - hostname             = "45-79-244-88.ip.linodeusercontent.com" -> null
      - id                   = "187417" -> null
      - ipv4                 = "45.79.244.88" -> null
      - ipv6                 = "2600:3c02:1::2d4f:f458" -> null
      - label                = "fealty_nodebalancer" -> null
      - region               = "us-southeast" -> null
      - tags                 = [
          - "fealty",
        ] -> null
      - transfer             = [
          - {
              - in    = 0
              - out   = 0
              - total = 0
            },
        ] -> null
      - updated              = "2021-12-31T13:28:07Z" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # acme_certificate.certificate will be created
  + resource "acme_certificate" "certificate" {
      + account_key_pem               = (sensitive value)
      + certificate_domain            = (known after apply)
      + certificate_p12               = (sensitive value)
      + certificate_pem               = (known after apply)
      + certificate_url               = (known after apply)
      + common_name                   = "rewards.josh.services"
      + disable_complete_propagation  = false
      + id                            = (known after apply)
      + issuer_pem                    = (known after apply)
      + key_type                      = "4096"
      + min_days_remaining            = 30
      + must_staple                   = false
      + pre_check_delay               = 60
      + private_key_pem               = (sensitive value)
      + revoke_certificate_on_destroy = false

      + dns_challenge {
          + config   = (sensitive value)
          + provider = "linode"
        }
    }

  # acme_registration.reg will be created
  + resource "acme_registration" "reg" {
      + account_key_pem  = (sensitive value)
      + email_address    = "linode@dangerous.tech"
      + id               = (known after apply)
      + registration_url = (known after apply)
    }

  # linode_domain.domain will be created
  + resource "linode_domain" "domain" {
      + domain    = "josh.services"
      + id        = (known after apply)
      + soa_email = "linode@dangerous.tech"
      + status    = (known after apply)
      + tags      = [
          + "fealty",
        ]
      + ttl_sec   = 30
      + type      = "master"
    }

  # linode_domain_record.rewards will be created
  + resource "linode_domain_record" "rewards" {
      + domain_id   = (known after apply)
      + id          = (known after apply)
      + name        = "rewards"
      + record_type = "A"
      + target      = (known after apply)
      + ttl_sec     = 30
    }

  # linode_instance.app[0] will be created
  + resource "linode_instance" "app" {
      + authorized_users   = [
          + "linodeDT",
        ]
      + backups            = (known after apply)
      + backups_enabled    = true
      + boot_config_label  = (known after apply)
      + id                 = (known after apply)
      + image              = "dummy"
      + ip_address         = (known after apply)
      + ipv4               = (known after apply)
      + ipv6               = (known after apply)
      + label              = "fealty_app_1"
      + private_ip         = true
      + private_ip_address = (known after apply)
      + region             = "us-southeast"
      + root_pass          = (sensitive value)
      + specs              = (known after apply)
      + status             = (known after apply)
      + swap_size          = (known after apply)
      + tags               = [
          + "fealty",
        ]
      + type               = "g6-nanode-1"
      + watchdog_enabled   = true

      + alerts {
          + cpu            = (known after apply)
          + io             = (known after apply)
          + network_in     = (known after apply)
          + network_out    = (known after apply)
          + transfer_quota = (known after apply)
        }

      + interface {
          + ipam_address = "10.10.10.2/24"
          + label        = "fealty-vlan"
          + purpose      = "vlan"
        }
    }

  # linode_instance.db will be created
  + resource "linode_instance" "db" {
      + authorized_users   = [
          + "linodeDT",
        ]
      + backups            = (known after apply)
      + backups_enabled    = true
      + boot_config_label  = (known after apply)
      + id                 = (known after apply)
      + image              = "dummy"
      + ip_address         = (known after apply)
      + ipv4               = (known after apply)
      + ipv6               = (known after apply)
      + label              = "fealty_db"
      + private_ip_address = (known after apply)
      + region             = "us-southeast"
      + specs              = (known after apply)
      + status             = (known after apply)
      + swap_size          = (known after apply)
      + tags               = [
          + "fealty",
        ]
      + type               = "g6-nanode-1"
      + watchdog_enabled   = true

      + alerts {
          + cpu            = (known after apply)
          + io             = (known after apply)
          + network_in     = (known after apply)
          + network_out    = (known after apply)
          + transfer_quota = (known after apply)
        }

      + interface {
          + ipam_address = "10.10.10.3/24"
          + label        = "fealty-vlan"
          + purpose      = "vlan"
        }
    }

  # linode_nodebalancer.app_nb will be created
  + resource "linode_nodebalancer" "app_nb" {
      + client_conn_throttle = 20
      + created              = (known after apply)
      + hostname             = (known after apply)
      + id                   = (known after apply)
      + ipv4                 = (known after apply)
      + ipv6                 = (known after apply)
      + label                = "fealty_nodebalancer"
      + region               = "us-southeast"
      + tags                 = [
          + "fealty",
        ]
      + transfer             = (known after apply)
      + updated              = (known after apply)
    }

  # linode_nodebalancer_config.app_nb_config will be created
  + resource "linode_nodebalancer_config" "app_nb_config" {
      + algorithm       = "source"
      + check           = "http"
      + check_attempts  = 3
      + check_body      = (known after apply)
      + check_interval  = 30
      + check_passive   = (known after apply)
      + check_path      = "/healthz"
      + check_timeout   = 5
      + cipher_suite    = "recommended"
      + id              = (known after apply)
      + node_status     = (known after apply)
      + nodebalancer_id = (known after apply)
      + port            = 443
      + protocol        = "https"
      + proxy_protocol  = "none"
      + ssl_cert        = (sensitive value)
      + ssl_commonname  = (known after apply)
      + ssl_fingerprint = (known after apply)
      + ssl_key         = (sensitive value)
      + stickiness      = "http_cookie"
    }

  # linode_nodebalancer_node.app_nb_node[0] will be created
  + resource "linode_nodebalancer_node" "app_nb_node" {
      + address         = (known after apply)
      + config_id       = (known after apply)
      + id              = (known after apply)
      + label           = "app-node-1"
      + mode            = "accept"
      + nodebalancer_id = (known after apply)
      + status          = (known after apply)
      + weight          = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ Domain_IP             = "45.79.244.88" -> (known after apply)
  ~ NodeBalancer_Hostname = "45-79-244-88.ip.linodeusercontent.com" -> (known after apply)
  ~ NodeBalancer_IPv4     = "45.79.244.88" -> (known after apply)
  ~ NodeBalancer_IPv6     = "2600:3c02:1::2d4f:f458" -> (known after apply)
  + SSL_Cert_Domain       = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @biodrone, Action: `pull_request`, Working Directory: `deploy`, Workflow: `CI`*